package com.mycom.myapp.workshop.annotation;

import org.springframework.stereotype.Component;
import java.util.List;
import java.util.Random;

@Component
public class GachaMachine {
    private final List<String> options = List.of( "피카츄", "이브이", "리자몽", "꼬부기", "파이리", "이상해씨", "뮤", "뮤츠", "레쿠쟈", "루기아",
            "개굴닌자", "보만다", "다크라이", "디아루가", "펄기아", "지라치", "레지기가스", "한카리아스", "가이오가", "그란돈",
            "번치코", "레파르다스", "루카리오", "잠만보", "고라파덕", "후딘", "켄타로스", "코뿌리", "라프라스", "마임맨",
            "딱구리", "또도가스", "왕구리", "아보크", "도나리", "강철톤", "헤라크로스", "마기라스", "레어코일", "샤미드",
            "우츠보트", "나시", "슈바르고", "망나뇽", "부스터", "에브이", "블래키", "레시라무", "제크로무", "토게키스",
            "장크로다일", "폭타", "맘모꾸리", "크로뱃", "헬가", "팬텀", "니드킹", "니드퀸", "노보청", "대짱이",
            "스왈로", "샤크니아", "버섯모", "찌리리공", "코일", "전룡", "피죤투", "버터플", "리자드", "아라리",
            "피콘", "오메가볼트", "썬더", "파이어", "프리져", "치라치노", "키링키", "레트라", "리피아", "글레이시아",
            "에레키드", "마그마", "전극", "야도란", "야돈", "도토링", "번치코", "아머까오", "두트리오", "루리리",
            "라티아스", "라티오스", "대검귀", "딜리버드", "폴리곤", "레파르다스", "알로라 식스테일", "한카리아스", "가디안", "제라오라");
    private final Random random = new Random();

    public String draw() {
        return options.get(random.nextInt(options.size()));
    }
}
